Ran Plan for 3 projects:

1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
1. dir: `management/global/sso` workspace: `default`
1. dir: `shared/us-east-1/secrets-manager` workspace: `default`
---

### 1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
<details><summary>Show Output</summary>

```diff
[14:03:46.164] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[14:03:46.175] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.shared_vpc: Reading...
data.terraform_remote_state.vpc: Reading...
data.aws_secretsmanager_secret_version.auth_token: Reading...
data.aws_secretsmanager_secret_version.auth_token: Read complete after 0s [id=/devops/apps-devstg/elasticache-redis/auth_token|AWSCURRENT]
data.terraform_remote_state.vpc: Read complete after 0s
data.terraform_remote_state.shared_vpc: Read complete after 0s

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # null_resource.cluster_mode will be created
  + resource "null_resource" "cluster_mode" {
      + id = (known after apply)
    }

  # null_resource.cluster_mode_and_failover will be created
  + resource "null_resource" "cluster_mode_and_failover" {
      + id = (known after apply)
    }

  # null_resource.multi_az_and_failover will be created
  + resource "null_resource" "multi_az_and_failover" {
      + id = (known after apply)
    }

  # module.elasticache.aws_cloudwatch_log_group.this["slow-log"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/elasticache/bb-apps-devstg"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all          = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
    }

  # module.elasticache.aws_elasticache_cluster.this[0] will be created
  + resource "aws_elasticache_cluster" "this" {
      + apply_immediately            = true
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = "true"
      + availability_zone            = (known after apply)
      + az_mode                      = (known after apply)
      + cache_nodes                  = (known after apply)
      + cluster_address              = (known after apply)
      + cluster_id                   = "bb-apps-devstg"
      + configuration_endpoint       = (known after apply)
      + engine                       = "redis"
      + engine_version               = "7.1"
      + engine_version_actual        = (known after apply)
      + id                           = (known after apply)
      + ip_discovery                 = (known after apply)
      + maintenance_window           = (known after apply)
      + network_type                 = (known after apply)
      + node_type                    = "cache.t3.small"
      + num_cache_nodes              = 1
      + parameter_group_name         = (known after apply)
      + port                         = 6379
      + preferred_availability_zones = []
      + preferred_outpost_arn        = (known after apply)
      + replication_group_id         = (known after apply)
      + security_group_ids           = (known after apply)
      + snapshot_arns                = []
      + snapshot_retention_limit     = 0
      + snapshot_window              = (known after apply)
      + subnet_group_name            = "bb-apps-devstg"
      + tags                         = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all                     = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
      + transit_encryption_enabled   = (known after apply)

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/bb-apps-devstg"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }

      + timeouts {}
    }

  # module.elasticache.aws_elasticache_parameter_group.this[0] will be created
  + resource "aws_elasticache_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "ElastiCache parameter group"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all    = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
    }

  # module.elasticache.aws_elasticache_subnet_group.this[0] will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group"
      + id          = (known after apply)
      + name        = "bb-apps-devstg"
      + subnet_ids  = [
          + "subnet-05d75d908f61d35e5",
          + "subnet-094c287defbc07180",
          + "subnet-0cec521de70ee76a3",
        ]
      + tags        = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all    = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
      + vpc_id      = (known after apply)
    }

  # module.elasticache.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bb-apps-devstg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all               = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
      + vpc_id                 = "vpc-072f329fed6757e95"
    }

  # module.elasticache.aws_vpc_security_group_egress_rule.this["egress_vpc"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "172.18.0.0/20"
      + description            = "VPC traffic"
      + from_port              = 6379
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all               = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
      + to_port                = 6379
    }

  # module.elasticache.aws_vpc_security_group_ingress_rule.this["ingress_vpc"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "172.18.0.0/20"
      + description            = "VPC traffic"
      + from_port              = 6379
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all               = {
          + "Environment"           = "apps-devstg"
          + "Layer"                 = "elasticache-redis"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "elasticache"
        }
      + to_port                = 6379
    }

  # module.elasticache.random_id.this[0] will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_address                                  = (known after apply)
  + port                                             = 6379



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d apps-devstg/us-east-1/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fapps-devstg%252Fus-east-1%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d apps-devstg/us-east-1/elasticache-redis
  ```
Plan: 11 to add, 0 to change, 0 to destroy.

---
### 2. dir: `management/global/sso` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'leverage tf plan -input=false -refresh -out="$REAL_PLANFILE"' in '/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso': exit status 1: running "leverage tf plan -input=false -refresh -out=\"$REAL_PLANFILE\"" in "/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso": 
[14:04:12.893] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[14:04:12.904] INFO     ✔ OK                                                    
                                                                                
module.account_assignments.null_resource.dependency: Refreshing state... [id=3572017111657332447]
module.permission_sets.data.aws_ssoadmin_instances.this: Reading...
module.account_assignments.data.aws_ssoadmin_instances.this: Reading...
data.aws_iam_policy_document.marketplaceseller: Reading...
data.aws_ssoadmin_instances.main: Reading...
data.aws_iam_policy_document.github_automation: Reading...
data.aws_iam_policy_document.data_scientist: Reading...
data.aws_iam_policy_document.devops: Reading...
data.aws_iam_policy_document.marketplaceseller: Read complete after 0s [id=216798746]
data.aws_iam_policy_document.github_automation: Read complete after 0s [id=1914219528]
data.aws_iam_policy_document.data_scientist: Read complete after 0s [id=1102031294]
data.aws_iam_policy_document.devops: Read complete after 0s [id=3868196803]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: f2e79477-cb77-4b26-88c4-c7ca87453ce4, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754575458753731965 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with data.aws_ssoadmin_instances.main,
│   on config.tf line 27, in data "aws_ssoadmin_instances" "main":
│   27: data "aws_ssoadmin_instances" "main" {}
│ 
╵
╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: 269d17a9-6e1f-4f5c-95d5-9c1eac9a81c3, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754575458753731965 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with module.account_assignments.data.aws_ssoadmin_instances.this,
│   on .terraform/modules/account_assignments/modules/account-assignments/main.tf line 60, in data "aws_ssoadmin_instances" "this":
│   60: data "aws_ssoadmin_instances" "this" {}
│ 
╵
╷
│ Error: reading SSO Instances: operation error SSO Admin: ListInstances, https response error StatusCode: 400, RequestID: 28d02bb2-995f-4d6a-937e-17b4f3d7e91b, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754575458753731965 is not authorized to perform: sso:ListInstances on resource: arn:aws:sso:::instance/* because no identity-based policy allows the sso:ListInstances action
│ 
│   with module.permission_sets.data.aws_ssoadmin_instances.this,
│   on .terraform/modules/permission_sets/modules/permission-sets/main.tf line 50, in data "aws_ssoadmin_instances" "this":
│   50: data "aws_ssoadmin_instances" "this" {}
│ 
╵


```
</details>

---
### 3. dir: `shared/us-east-1/secrets-manager` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'leverage tf plan -input=false -refresh -out="$REAL_PLANFILE"' in '/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/shared/us-east-1/secrets-manager': exit status 1: running "leverage tf plan -input=false -refresh -out=\"$REAL_PLANFILE\"" in "/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/shared/us-east-1/secrets-manager": 
[14:04:30.872] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[14:04:30.882] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.keys: Reading...
data.terraform_remote_state.keys: Read complete after 0s
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-aurora/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/monitoring"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2]
module.secrets.aws_secretsmanager_secret.sm["/repositories/le-demo-apps/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko]
module.secrets.aws_secretsmanager_secret.sm["/devops/shared/atlantis"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs]
module.secrets.aws_secretsmanager_secret.sm["/notifications/argocd"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/phone/notifications"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa]
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/elasticache-redis/auth_token"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX]
module.secrets.aws_secretsmanager_secret.sm["/repositories/demo-google-microservices/deploy_key"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa]
module.secrets.aws_secretsmanager_secret.sm["/notifications/slack/cost-reports"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2]
module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/grafana/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J]
module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-mysql/administrator"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4]
module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/security"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0]
module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/alertmanager"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK]
data.aws_iam_policy_document.secrets_policy: Reading...
data.aws_iam_policy_document.secrets_policy: Read complete after 0s [id=2203052713]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/monitoring-jpCyU2 because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 722c657f-29e2-406c-982f-6bdd9186b02e
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/monitoring"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/le-demo-apps/deploy_key-VuoTko because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 7ecb6614-bee8-41f4-953a-0bd4ed844e7d
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/repositories/le-demo-apps/deploy_key"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-aurora/administrator-ZAJSp1 because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 95dd612d-e6fe-42d5-97aa-5c011b740484
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-aurora/administrator"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/database-mysql/administrator-3C2JG4 because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 658bfd9f-c73a-4c29-a20e-4bdc1a43475c
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/database-mysql/administrator"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/repositories/demo-google-microservices/deploy_key-QW8ufa because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 41e647e4-3412-4952-ab43-fb4e9c4d1efe
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/repositories/demo-google-microservices/deploy_key"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/phone/notifications-2jm5Pa because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 2b5b19bf-f794-4bac-bead-f92e86c2c734
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/phone/notifications"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/argocd-Sa3w0p because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 1f6077c4-076f-431e-991e-9dc051077b7d
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/notifications/argocd"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/notifications/slack/security-To03y0 because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 39c09e0f-e5f8-4612-9fa0-b75a3a9ba9a7
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/notifications/slack/security"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/apps-devstg/elasticache-redis/auth_token-rcUmEX because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 4553f243-aeed-4f2b-bced-ff6a318ddc2e
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/apps-devstg/elasticache-redis/auth_token"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/grafana/administrator-2x6r9J because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 7b771177-22d5-4202-affc-561f57274103
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/grafana/administrator"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/notifications/slack/cost-reports-m8z5y2 because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 1fbcabf2-b98a-42ee-abff-ad40cfa17af1
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/notifications/slack/cost-reports"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/shared/atlantis-NJaROs because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: 3ee95029-3418-4b37-9c56-e9f6493112be
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/shared/atlantis"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK) policy: AccessDeniedException: User: arn:aws:sts::763606934258:assumed-role/Atlantis/aws-go-sdk-1754575475244887285 is not authorized to perform: secretsmanager:GetResourcePolicy on resource: arn:aws:secretsmanager:us-east-1:763606934258:secret:/devops/monitoring/alertmanager-ev0FIK because no identity-based policy allows the secretsmanager:GetResourcePolicy action
│ 	status code: 400, request id: cd9ad5c3-0c0f-4310-abad-90e080a2faf6
│ 
│   with module.secrets.aws_secretsmanager_secret.sm["/devops/monitoring/alertmanager"],
│   on .terraform/modules/secrets/main.tf line 1, in resource "aws_secretsmanager_secret" "sm":
│    1: resource "aws_secretsmanager_secret" "sm" {
│ 
╵


```
</details>

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```